<template>
	<div class="settings-app policy">
		<div class="policy-list">
			<div class="policy-item" :class="color_schema.item" v-b-toggle="'policy-collapse'"aria-expanded="false">
				<div class="collapse-item">
					<div class="item-title">
						ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ
					</div>
					<div class="item-actions">
						<button style="border: 0" class="collapse-link btn-action" />
					</div>
				</div>
				<b-collapse id="policy-collapse" accordion role="tabpanel">
					<div class="policy-collapse" :class="[color_schema.item, color_schema.text]">
						<div class="group-policy" :class="color_schema.global">
							<img src="../assets/image1.png" alt="image1.png" class="policy-image">
							<div class="info">
								<div class="text">Общество с ограниченной ответственностью</div>
								<div style="font-size: 20px">«Лост Веа»</div>
								<div class="text" style="font-size: 12px">
									Адрес: 129090, г. Москва, проспект Мира, д. 19, стр. 1, этаж 1, помещение I, комната 6, офис 16. ИНН / КПП 7702434403/770201001 ОГРН 1187746659385
								</div>
							</div>
						</div>
						<div class="description-policy text">
							<p>
								ООО «Лост Веа» соблюдает конфиденциальность интернет-посетителей и пользователей ее продуктов и услуг, а также положения действующих законов о защите частной жизни.
							</p>
							
							<p :class="color_schema.title_text">1. Определения.</p>
							<p>
								В настоящем документе Персональными данными считаются любые данные, которые могут идентифицировать вашу личность («Персональные данные») или косвенно с вами связаны за счет привязки к Персональным данным. ООО «Лост Веа» также обрабатывает анонимные данные, в том числе сводные, чтобы анализировать и получать статистическую информацию в отношении привычек, особенностей использования и демографических параметров клиентов, рассматриваемых коллективно, а не по отдельности. Такие анонимные данные не позволяют установить личности клиентов, с которыми они связаны. ООО «Лост Веа» имеет право предоставлять анонимные данные (в агрегированном или не агрегированном виде) третьим сторонам.
							</p>
							<p :class="color_schema.title_text">2. Зачем ООО «Лост Веа» осуществляет сбор и обработку данных.</p>
							<p>
								а) когда это необходимо для исполнения нашего соглашения с вами, чтобы обеспечивать полнофункциональный сервис и предоставлять соответствующий Контент и Услуги;
							</p>
							<p>
								б) когда это необходимо для соблюдения надлежащих правовых обязательств (например, обязательств сохранять информацию в соответствии с налоговым законодательством);
							</p>
							<p>
								в) когда это необходимо в целях осуществления законных интересов ООО «Лост Веа» или третьей стороны (например, интересов других клиентов), если только такие интересы не перевешиваются вашими преобладающими законными интересами и правами;
							</p>
							<p :class="color_schema.title_text">3. Какие данные мы собираем и обрабатываем.</p>
							<p :class="color_schema.title_text">3.1 Основные учетные данные.</p>
							<p>
								При настройке Аккаунта компания ООО «Лост Веа» запрашивает ваш адрес электронной почты. Вы также должны выбрать имя пользователя и пароль. Вы также можете осуществить регистрацию через аккаунт стороннего сервиса. Предоставление такой информации необходимо для регистрации Аккаунта. При настройке аккаунту автоматически присваивается номер («Steam ID»), который в дальнейшем используется для ссылки на ваш аккаунт без прямого указания ваших Персональных данных.
							</p>
							<p :class="color_schema.title_text">3.2 Транзакции и платежные данные.</p>
							<p>
								Для совершения транзакций в DS платформе (например, для приобретения подписки на Контент и Услуги или для Доната Стримеру), вам необходимо предоставить ООО «Лост Веа» платежные данные, чтобы обеспечить возможность проведения транзакции. Если вы используете для оплаты кредитную карту, вам необходимо предоставить компании ООО «Лост Веа» информацию о кредитной карте (имя, адрес, номер кредитной карты, дату истечения срока действия и защитный код), которую компания ООО «Лост Веа» обрабатывает и передает оператору платежной системы, чтобы обеспечить возможность проведения транзакции и выполнения проверок для борьбы с мошенничеством. Точно так же компания ООО «Лост Веа» будет получать данные от вашего оператора платежной системы по тем же причинам.
							</p>
							<p :class="color_schema.title_text">3.3 Другие явно предоставляемые вами данные.</p>
							<p>
								Мы собираем и обрабатываем Персональные данные, которые вы отправляете нам в явной форме. Эти данные включают в себя следующее:
							</p>
							<p>
								• сведения, которые вы предоставляете, когда запрашиваете у нас информацию или техническую поддержку либо приобретаете Контент и Услуги, включая сведения, необходимые для обработки ваших заказов с применением соответствующего механизма оплаты;
							</p>
							<p>
								• сведения, которые вы нам предоставляете, участвуя в конкурсах, соревнованиях, турнирах или опросах, например, ваши контактные данные.
							</p>
							<p :class="color_schema.title_text">4. Срок хранения данных.</p>
							<p>
								Мы храним вашу информацию лишь в течение срока, необходимого для достижения целей, в которых осуществляется сбор и обработка такой информации, или (если действующее законодательство предусматривает более длительной срок хранения) в течение срока хранения, требующегося по закону. После окончания этого срока ваши Персональные данные удаляются, блокируются или анонимизируются, как это предусмотрено действующим законодательством.
							</p>
							<p>
								В частности:
							</p>
							<p>
								• Если вы закрываете свой Аккаунт, ваши Персональные данные отмечаются для удаления, за исключением случаев, когда юридические требования или другие преобладающие законные цели требуют более длительного хранения.
							</p>
							<p>
								• Если вы отзываете свое согласие на обработку ваших Персональных данных, мы удаляем ваши Персональные данные без неоправданной задержки в той мере, в какой сбор и обработка персональных данных основаны на отзыве согласия.
							</p>
							<p>
								• Если вы используете право на возражение против обработки ваших Персональных данных, мы рассматриваем ваше возражение и без неоправданной задержки удаляем ваши Персональные данные, обрабатываемые с целью, против которой вы возражаете, если нет иной правовой основы для обработки и хранения этих данных или сохранение этих данных не требуется в соответствии с действующим законодательством.
							</p>
						</div>
					</div>
				</b-collapse>
			</div>
			<div class="policy-item" :class="color_schema.item" v-b-toggle="'policy-collapse-condition'" accordion role="tabpanel" aria-expanded="false">
				<div class="collapse-item">
					<div class="item-title">
						УСЛОВИЯ ПРЕДОСТАВЛЕНИЯ УСЛУГ
					</div>
					<div class="item-actions">
						<button style="border: 0" class="collapse-link btn-action" />
					</div>
				</div>
				<b-collapse id="policy-collapse-condition" accordion role="tabpanel">
					<div class="policy-collapse" :class="[color_schema.item, color_schema.text]">
						<div class="group-policy" :class="color_schema.global">
							<img src="../assets/image1.png" alt="image1.png" class="policy-image">
							<div class="info">
								<div class="text">Общество с ограниченной ответственностью</div>
								<h5>«Лост Веа»</h5>
								<div class="text">
									Адрес: 129090, г. Москва, проспект Мира, д. 19, стр. 1, этаж 1, помещение I, комната 6, офис 16. ИНН / КПП 7702434403/770201001 ОГРН 1187746659385
								</div>
							</div>
						</div>
						<div class="description-policy text">
							<p>
								ООО «Лост Веа» соблюдает конфиденциальность интернет-посетителей и пользователей ее продуктов и услуг, а также положения действующих законов о защите частной жизни.
							</p>
							
							<p :class="color_schema.title_text">1. Определения.</p>
							<p>
								В настоящем документе Персональными данными считаются любые данные, которые могут идентифицировать вашу личность («Персональные данные») или косвенно с вами связаны за счет привязки к Персональным данным. ООО «Лост Веа» также обрабатывает анонимные данные, в том числе сводные, чтобы анализировать и получать статистическую информацию в отношении привычек, особенностей использования и демографических параметров клиентов, рассматриваемых коллективно, а не по отдельности. Такие анонимные данные не позволяют установить личности клиентов, с которыми они связаны. ООО «Лост Веа» имеет право предоставлять анонимные данные (в агрегированном или не агрегированном виде) третьим сторонам.
							</p>
							<p :class="color_schema.title_text">2. Зачем ООО «Лост Веа» осуществляет сбор и обработку данных.</p>
							<p>
								а) когда это необходимо для исполнения нашего соглашения с вами, чтобы обеспечивать полнофункциональный сервис и предоставлять соответствующий Контент и Услуги;
							</p>
							<p>
								б) когда это необходимо для соблюдения надлежащих правовых обязательств (например, обязательств сохранять информацию в соответствии с налоговым законодательством);
							</p>
							<p>
								в) когда это необходимо в целях осуществления законных интересов ООО «Лост Веа» или третьей стороны (например, интересов других клиентов), если только такие интересы не перевешиваются вашими преобладающими законными интересами и правами;
							</p>
							<p :class="color_schema.title_text">3. Какие данные мы собираем и обрабатываем.</p>
							<p :class="color_schema.title_text">3.1 Основные учетные данные.</p>
							<p>
								При настройке Аккаунта компания ООО «Лост Веа» запрашивает ваш адрес электронной почты. Вы также должны выбрать имя пользователя и пароль. Вы также можете осуществить регистрацию через аккаунт стороннего сервиса. Предоставление такой информации необходимо для регистрации Аккаунта. При настройке аккаунту автоматически присваивается номер («Steam ID»), который в дальнейшем используется для ссылки на ваш аккаунт без прямого указания ваших Персональных данных.
							</p>
							<p :class="color_schema.title_text">3.2 Транзакции и платежные данные.</p>
							<p>
								Для совершения транзакций в DS платформе (например, для приобретения подписки на Контент и Услуги или для Доната Стримеру), вам необходимо предоставить ООО «Лост Веа» платежные данные, чтобы обеспечить возможность проведения транзакции. Если вы используете для оплаты кредитную карту, вам необходимо предоставить компании ООО «Лост Веа» информацию о кредитной карте (имя, адрес, номер кредитной карты, дату истечения срока действия и защитный код), которую компания ООО «Лост Веа» обрабатывает и передает оператору платежной системы, чтобы обеспечить возможность проведения транзакции и выполнения проверок для борьбы с мошенничеством. Точно так же компания ООО «Лост Веа» будет получать данные от вашего оператора платежной системы по тем же причинам.
							</p>
							<p :class="color_schema.title_text">3.3 Другие явно предоставляемые вами данные.</p>
							<p>
								Мы собираем и обрабатываем Персональные данные, которые вы отправляете нам в явной форме. Эти данные включают в себя следующее:
							</p>
							<p>
								• сведения, которые вы предоставляете, когда запрашиваете у нас информацию или техническую поддержку либо приобретаете Контент и Услуги, включая сведения, необходимые для обработки ваших заказов с применением соответствующего механизма оплаты;
							</p>
							<p>
								• сведения, которые вы нам предоставляете, участвуя в конкурсах, соревнованиях, турнирах или опросах, например, ваши контактные данные.
							</p>
							<p :class="color_schema.title_text">4. Срок хранения данных.</p>
							<p>
								Мы храним вашу информацию лишь в течение срока, необходимого для достижения целей, в которых осуществляется сбор и обработка такой информации, или (если действующее законодательство предусматривает более длительной срок хранения) в течение срока хранения, требующегося по закону. После окончания этого срока ваши Персональные данные удаляются, блокируются или анонимизируются, как это предусмотрено действующим законодательством.
							</p>
							<p>
								В частности:
							</p>
							<p>
								• Если вы закрываете свой Аккаунт, ваши Персональные данные отмечаются для удаления, за исключением случаев, когда юридические требования или другие преобладающие законные цели требуют более длительного хранения.
							</p>
							<p>
								• Если вы отзываете свое согласие на обработку ваших Персональных данных, мы удаляем ваши Персональные данные без неоправданной задержки в той мере, в какой сбор и обработка персональных данных основаны на отзыве согласия.
							</p>
							<p>
								• Если вы используете право на возражение против обработки ваших Персональных данных, мы рассматриваем ваше возражение и без неоправданной задержки удаляем ваши Персональные данные, обрабатываемые с целью, против которой вы возражаете, если нет иной правовой основы для обработки и хранения этих данных или сохранение этих данных не требуется в соответствии с действующим законодательством.
							</p>
						</div>
					</div>
				</b-collapse>
			</div>
			<div class="policy-item" :class="color_schema.item" v-b-toggle="'policy-collapse-payment'" aria-expanded="false">
				<div class="collapse-item">
					<div class="item-title">
						УСЛОВИЯ ОПЛАТЫ
					</div>
					<div class="item-actions">
						<button style="border: 0" class="collapse-link btn-action" />
					</div>
				</div>
				<b-collapse id="policy-collapse-payment" accordion role="tabpanel">
					<div class="policy-collapse" :class="[color_schema.item, color_schema.text]">
						<div class="group-policy" :class="color_schema.global">
							<img src="../assets/image1.png" alt="image1.png" class="policy-image">
							<div class="info">
								<div class="text">Общество с ограниченной ответственностью</div>
								<h5>«Лост Веа»</h5>
								<div class="text">
									Адрес: 129090, г. Москва, проспект Мира, д. 19, стр. 1, этаж 1, помещение I, комната 6, офис 16. ИНН / КПП 7702434403/770201001 ОГРН 1187746659385
								</div>
							</div>
						</div>
						<div class="description-policy text">
							<p>
								ООО «Лост Веа» соблюдает конфиденциальность интернет-посетителей и пользователей ее продуктов и услуг, а также положения действующих законов о защите частной жизни.
							</p>
							
							<p :class="color_schema.title_text">1. Определения.</p>
							<p>
								В настоящем документе Персональными данными считаются любые данные, которые могут идентифицировать вашу личность («Персональные данные») или косвенно с вами связаны за счет привязки к Персональным данным. ООО «Лост Веа» также обрабатывает анонимные данные, в том числе сводные, чтобы анализировать и получать статистическую информацию в отношении привычек, особенностей использования и демографических параметров клиентов, рассматриваемых коллективно, а не по отдельности. Такие анонимные данные не позволяют установить личности клиентов, с которыми они связаны. ООО «Лост Веа» имеет право предоставлять анонимные данные (в агрегированном или не агрегированном виде) третьим сторонам.
							</p>
							<p :class="color_schema.title_text">2. Зачем ООО «Лост Веа» осуществляет сбор и обработку данных.</p>
							<p>
								а) когда это необходимо для исполнения нашего соглашения с вами, чтобы обеспечивать полнофункциональный сервис и предоставлять соответствующий Контент и Услуги;
							</p>
							<p>
								б) когда это необходимо для соблюдения надлежащих правовых обязательств (например, обязательств сохранять информацию в соответствии с налоговым законодательством);
							</p>
							<p>
								в) когда это необходимо в целях осуществления законных интересов ООО «Лост Веа» или третьей стороны (например, интересов других клиентов), если только такие интересы не перевешиваются вашими преобладающими законными интересами и правами;
							</p>
							<p :class="color_schema.title_text">3. Какие данные мы собираем и обрабатываем.</p>
							<p :class="color_schema.title_text">3.1 Основные учетные данные.</p>
							<p>
								При настройке Аккаунта компания ООО «Лост Веа» запрашивает ваш адрес электронной почты. Вы также должны выбрать имя пользователя и пароль. Вы также можете осуществить регистрацию через аккаунт стороннего сервиса. Предоставление такой информации необходимо для регистрации Аккаунта. При настройке аккаунту автоматически присваивается номер («Steam ID»), который в дальнейшем используется для ссылки на ваш аккаунт без прямого указания ваших Персональных данных.
							</p>
							<p :class="color_schema.title_text">3.2 Транзакции и платежные данные.</p>
							<p>
								Для совершения транзакций в DS платформе (например, для приобретения подписки на Контент и Услуги или для Доната Стримеру), вам необходимо предоставить ООО «Лост Веа» платежные данные, чтобы обеспечить возможность проведения транзакции. Если вы используете для оплаты кредитную карту, вам необходимо предоставить компании ООО «Лост Веа» информацию о кредитной карте (имя, адрес, номер кредитной карты, дату истечения срока действия и защитный код), которую компания ООО «Лост Веа» обрабатывает и передает оператору платежной системы, чтобы обеспечить возможность проведения транзакции и выполнения проверок для борьбы с мошенничеством. Точно так же компания ООО «Лост Веа» будет получать данные от вашего оператора платежной системы по тем же причинам.
							</p>
							<p :class="color_schema.title_text">3.3 Другие явно предоставляемые вами данные.</p>
							<p>
								Мы собираем и обрабатываем Персональные данные, которые вы отправляете нам в явной форме. Эти данные включают в себя следующее:
							</p>
							<p>
								• сведения, которые вы предоставляете, когда запрашиваете у нас информацию или техническую поддержку либо приобретаете Контент и Услуги, включая сведения, необходимые для обработки ваших заказов с применением соответствующего механизма оплаты;
							</p>
							<p>
								• сведения, которые вы нам предоставляете, участвуя в конкурсах, соревнованиях, турнирах или опросах, например, ваши контактные данные.
							</p>
							<p :class="color_schema.title_text">4. Срок хранения данных.</p>
							<p>
								Мы храним вашу информацию лишь в течение срока, необходимого для достижения целей, в которых осуществляется сбор и обработка такой информации, или (если действующее законодательство предусматривает более длительной срок хранения) в течение срока хранения, требующегося по закону. После окончания этого срока ваши Персональные данные удаляются, блокируются или анонимизируются, как это предусмотрено действующим законодательством.
							</p>
							<p>
								В частности:
							</p>
							<p>
								• Если вы закрываете свой Аккаунт, ваши Персональные данные отмечаются для удаления, за исключением случаев, когда юридические требования или другие преобладающие законные цели требуют более длительного хранения.
							</p>
							<p>
								• Если вы отзываете свое согласие на обработку ваших Персональных данных, мы удаляем ваши Персональные данные без неоправданной задержки в той мере, в какой сбор и обработка персональных данных основаны на отзыве согласия.
							</p>
							<p>
								• Если вы используете право на возражение против обработки ваших Персональных данных, мы рассматриваем ваше возражение и без неоправданной задержки удаляем ваши Персональные данные, обрабатываемые с целью, против которой вы возражаете, если нет иной правовой основы для обработки и хранения этих данных или сохранение этих данных не требуется в соответствии с действующим законодательством.
							</p>
						</div>
					</div>
				</b-collapse>
			</div>
		</div>
	</div>
</template>

<script>
	import { mapGetters } from 'vuex'
	export default {
		name: 'policy',
		computed: {
			...mapGetters(['color_schema'])
		}
	}

</script>


<style> 
.collapse-item {
	display: flex;
	justify-content: space-between;
	align-items: center;
}
.policy-item {
	border-radius: 10px;
	padding: 20px;
	margin-top: 20px;
}
.group-policy {
	display: flex;
}
div#policy-collapse {
    font-size: 12px;
}
</style>